import React, { useState, useEffect, useCallback } from "react";
import "./UmaMusu2.css";
import DragItem from '../../component/DragItem/DragItem';
import Layout from '../../component/Layout/Layout';
import DropZone from '../../component/DropZone/DropZone'

import { DndProvider } from 'react-dnd'
import { HTML5Backend } from 'react-dnd-html5-backend'
import { TouchBackend } from 'react-dnd-touch-backend'


// ___________
//
export default function UmaMusu2() {
  const [racePoint, setRacePoint] = useState(0);
  const [formData, setFormData] = useState(initFormData);
  const [UmaList, setUmaList] = useState(umaNames.map((name) => <DragItem key={name} umaname={name}/>));
  const [lineage, setLineage] = useState(0);
  const [lineageIcon, setLineageIcon] = useState("△");

  const sortUmaIcon = (umaname) =>{
    let umalist = umaData[umaname];
    let res = Object.entries(umalist);
    res.sort(function(p1, p2){
      var p1Val = p1[1], p2Val = p2[1];
      return p1Val - p2Val;
    })
    umalist = Object.fromEntries(res);
    res = []
    
    Object.keys(umalist).forEach(key => res.push(key));
    res = res.reverse()
    setUmaList(res.map((key) => {
      if(key != ""){
        return <DragItem key={key} umaname={key}/>
      }
    }
    ))
  }

  const updateFormItem = useCallback((key, umaName, race) => {
    setFormData(prevData => {
      const newFormData = {...prevData, [key]: umaName}
      const {point, icon} = computeLineage(newFormData, race)
      setLineage(point)
      setLineageIcon(icon)
      return newFormData
    })

  }, [])
  const updateRacePoint = useCallback((race) => {
    setRacePoint(race)
    setFormData(prevData => {
      const {point, icon} = computeLineage(prevData, race)
      setLineage(point)
      setLineageIcon(icon)
      return prevData
    })
  }, [])

  return (
    <Layout>
    <div>ウマ娘相性確認！</div>
    <div className="point_view">相性：{lineageIcon}({lineage})</div>
    <DndProvider backend={selectBackend()}>
    <div className="lineage_block">
      親と祖父母の同一勝利レース数を入れてください。<br/>
      (大きな影響はないので適当にあてはめて確認するのがいいと思います。)<br/>
      <input type="number" onChange={ (e) => { setRacePoint(e.target.value) },(e) => { updateRacePoint(e.target.value) }} value={racePoint}></input>
      <div className="child">
      <DropZone areaName = "ME" updateFormItem={updateFormItem} formData = {formData} sortUmaIcon={sortUmaIcon} racePoint={racePoint} />
      </div>
      <hr className="ver bottom"/>
      <hr className="hol"/>
      <div className="border">
        <hr className="ver"/>
        <hr className="ver"/>
      </div>

      <div className="parent">
      <DropZone areaName = "MO" updateFormItem={updateFormItem} formData = {formData} racePoint={racePoint}   />
      <DropZone areaName = "FA" updateFormItem={updateFormItem} formData = {formData} racePoint={racePoint} />
      </div>
      <div className="border">
        <hr className="ver"/>
        <hr className="ver"/>
      </div>
      <div className="hr_area">
        <hr className="hol2"/>
        <hr className="hol2"/>
      </div>
      <div className="hr_area">
        <hr className="ver"/>
        <hr className="ver"/>
        <hr className="ver"/>
        <hr className="ver"/>
      </div>

      <div className="grand_parent">
      <DropZone areaName = "gmMO" updateFormItem={updateFormItem} formData = {formData} racePoint={racePoint}   />
      <DropZone areaName = "gmFA" updateFormItem={updateFormItem} formData = {formData} racePoint={racePoint}   />

      <DropZone areaName = "gfMO" updateFormItem={updateFormItem} formData = {formData} racePoint={racePoint}   />
      <DropZone areaName = "gfFA" updateFormItem={updateFormItem} formData = {formData} racePoint={racePoint}   />
      </div>
    </div>
   
    <div className="discription">育成ウマ娘との相性順にソートされます。</div>
    <div className="drop_data" id="drop_data">
      {UmaList}
      <div className="scrole_zone">スクロール→</div>
    </div>
    </DndProvider>
    </Layout>
  )
}


// ___________
//


const computeLineage = (formData, racePoint) => {
  let tortal_factor_point = 0;
  const ME = (umaRerationList[formData.ME] == undefined) ? [] : umaRerationList[formData.ME]
  const MO = (umaRerationList[formData.MO] == undefined) ? [] : umaRerationList[formData.MO]
  const gmMO = (umaRerationList[formData.gmMO] == undefined) ? [] : umaRerationList[formData.gmMO]
  const gmFA = (umaRerationList[formData.gmFA] == undefined) ? [] : umaRerationList[formData.gmFA]
  const FA = (umaRerationList[formData.FA] == undefined) ? [] : umaRerationList[formData.FA]
  const gfMO = (umaRerationList[formData.gfMO] == undefined) ? [] : umaRerationList[formData.gfMO]
  const gfFA = (umaRerationList[formData.gfFA] == undefined) ? [] : umaRerationList[formData.gfFA]
  const MEPoint = umaData[formData.ME][formData.MO] + umaData[formData.ME][formData.FA] 
  const PAPoint = umaData[formData.MO][formData.FA]
  console.log("MO")
  console.log(umaData[formData.ME][formData.MO])
  console.log("FA")
  console.log(umaData[formData.ME][formData.FA] )
  console.log("PAPoint")
  console.log(PAPoint)

  
  let point=[]
  let tmp = []
  if(formData.ME != formData.gmMO){
    getCommonElementsArray(ME, MO, gmMO).forEach((e)=>{
      point.push(umaReration[e])
      tmp.push(umaReration[e])
    })
  }
  console.log("gmMO")
  console.log(tmp.reduce((sum, element) => Number(sum) + Number(element), 0))
  if(formData.ME != formData.gmFA){
    getCommonElementsArray(ME, MO, gmFA).forEach((e)=>{
      point.push(umaReration[e])
      tmp.push(umaReration[e])
    })
  }
  console.log("gmFA")
  console.log(tmp.reduce((sum, element) => Number(sum) + Number(element), 0))
  if(formData.ME != formData.gfMO){
    getCommonElementsArray(ME, FA, gfMO).forEach((e)=>{
      point.push(umaReration[e])
      tmp.push(umaReration[e])
    })
  }
  console.log("gfMO")
  console.log(tmp.reduce((sum, element) => Number(sum) + Number(element), 0))
  if(formData.ME != formData.gfFA){
    getCommonElementsArray(ME, FA, gfFA).forEach((e)=>{
      point.push(umaReration[e])
      tmp.push(umaReration[e])
    })
  }
  console.log("gfFA")
  console.log(tmp.reduce((sum, element) => Number(sum) + Number(element), 0))
  
  let reration = point.reduce((sum, element) => Number(sum) + Number(element), 0);

  const lineagePoint = reration + MEPoint + PAPoint + Number(racePoint)
  let lineageIcon = ''
  if(lineagePoint > 150){
    lineageIcon = '◎'
  } else if(lineagePoint > 50){
    lineageIcon = '〇'
  } else{
    lineageIcon = '△'
  }
    
  return {point: lineagePoint, icon: lineageIcon};
};

function selectBackend(){
  return (isAndroid() || isIOS()) ? TouchBackend : HTML5Backend
}

function isAndroid() {
  return !!window.navigator.userAgent.match(/Android/);
}

function isIOS() {
  return !!window.navigator.userAgent.match(/iPhone|iPad|iPod/);
}

var getCommonElementsArray = function(){
  var i = 1, j = 0;
  function removeArrayDuplicates(array) {
    return array.filter(function(value, index, self) {
      return self.indexOf(value) === index;
    });
  }
  var cmnElmArray = arguments[0].slice();
  cmnElmArray = removeArrayDuplicates(cmnElmArray);
  var tgtElmArray = [];
  while(i < arguments.length){
    tgtElmArray = arguments[i++].slice();
    j = 0;
    while(j < cmnElmArray.length){
      if(tgtElmArray.indexOf(cmnElmArray[j])>=0){
        j++;
      }else{
        cmnElmArray.splice(j, 1);
      }
    }
  }
  return cmnElmArray;
};


const initFormData = {
  ME: "",
  POINT: 0,
  MO: "",
  gmMO: "",
  gmFA: "",
  mPOINT: 0,
  FA: "",
  gfMO: "",
  gfFA: "",
  fPOINT: 0,
  result: 0,
  result_icon: "△"
};

const umaData = {"アグネスタキオン": {"アグネスタキオン": 0, "ウイニングチケット": 24, "ウオッカ": 25, "エアグルーヴ": 18, "エルコンドルパサー": 16, "オグリキャップ": 24, "キングヘイロー": 19, "グラスワンダー": 23, "ゴールドシップ": 18, "サイレンススズカ": 20, "サクラバクシンオー": 11, "シンボリルドルフ": 18, "スーパークリーク": 18, "スペシャルウィーク": 25, "タイキシャトル": 11, "ダイワスカーレット": 17, "テイエムオペラオー": 19, "トウカイテイオー": 21, "ナイスネイチャ": 26, "ハルウララ": 3, "ビワハヤヒデ": 17, "マチカネフクキタル": 27, "マヤノトップガン": 17, "マルゼンスキー": 10, "ミホノブルボン": 21, "メジロマックイーン": 19, "メジロライアン": 24, "ライスシャワー": 18, "": 0}, "ウイニングチケット": {"アグネスタキオン": 24, "ウイニングチケット": 0, "ウオッカ": 24, "エアグルーヴ": 19, "エルコンドルパサー": 16, "オグリキャップ": 26, "キングヘイロー": 17, "グラスワンダー": 22, "ゴールドシップ": 22, "サイレンススズカ": 18, "サクラバクシンオー": 10, "シンボリルドルフ": 18, "スーパークリーク": 19, "スペシャルウィーク": 27, "タイキシャトル": 9, "ダイワスカーレット": 17, "テイエムオペラオー": 18, "トウカイテイオー": 19, "ナイスネイチャ": 25, "ハルウララ": 3, "ビワハヤヒデ": 26, "マチカネフクキタル": 25, "マヤノトップガン": 20, "マルゼンスキー": 10, "ミホノブルボン": 18, "メジロマックイーン": 19, "メジロライアン": 25, "ライスシャワー": 16, "": 0}, "ウオッカ": {"アグネスタキオン": 25, "ウイニングチケット": 24, "ウオッカ": 0, "エアグルーヴ": 20, "エルコンドルパサー": 23, "オグリキャップ": 31, "キングヘイロー": 18, "グラスワンダー": 29, "ゴールドシップ": 16, "サイレンススズカ": 16, "サクラバクシンオー": 8, "シンボリルドルフ": 17, "スーパークリーク": 17, "スペシャルウィーク": 26, "タイキシャトル": 16, "ダイワスカーレット": 34, "テイエムオペラオー": 18, "トウカイテイオー": 24, "ナイスネイチャ": 24, "ハルウララ": 3, "ビワハヤヒデ": 16, "マチカネフクキタル": 23, "マヤノトップガン": 16, "マルゼンスキー": 15, "ミホノブルボン": 25, "メジロマックイーン": 21, "メジロライアン": 22, "ライスシャワー": 15, "": 0}, "エアグルーヴ": {"アグネスタキオン": 18, "ウイニングチケット": 19, "ウオッカ": 20, "エアグルーヴ": 0, "エルコンドルパサー": 23, "オグリキャップ": 16, "キングヘイロー": 12, "グラスワンダー": 16, "ゴールドシップ": 19, "サイレンススズカ": 18, "サクラバクシンオー": 17, "シンボリルドルフ": 25, "スーパークリーク": 25, "スペシャルウィーク": 18, "タイキシャトル": 16, "ダイワスカーレット": 27, "テイエムオペラオー": 24, "トウカイテイオー": 26, "ナイスネイチャ": 17, "ハルウララ": 3, "ビワハヤヒデ": 25, "マチカネフクキタル": 17, "マヤノトップガン": 16, "マルゼンスキー": 9, "ミホノブルボン": 17, "メジロマックイーン": 25, "メジロライアン": 17, "ライスシャワー": 22, "": 0}, "エルコンドルパサー": {"アグネスタキオン": 16, "ウイニングチケット": 16, "ウオッカ": 23, "エアグルーヴ": 23, "エルコンドルパサー": 0, "オグリキャップ": 23, "キングヘイロー": 15, "グラスワンダー": 35, "ゴールドシップ": 17, "サイレンススズカ": 17, "サクラバクシンオー": 17, "シンボリルドルフ": 27, "スーパークリーク": 23, "スペシャルウィーク": 25, "タイキシャトル": 27, "ダイワスカーレット": 30, "テイエムオペラオー": 26, "トウカイテイオー": 24, "ナイスネイチャ": 17, "ハルウララ": 2, "ビワハヤヒデ": 23, "マチカネフクキタル": 16, "マヤノトップガン": 16, "マルゼンスキー": 17, "ミホノブルボン": 22, "メジロマックイーン": 22, "メジロライアン": 17, "ライスシャワー": 26, "": 0}, "オグリキャップ": {"アグネスタキオン": 24, "ウイニングチケット": 26, "ウオッカ": 31, "エアグルーヴ": 16, "エルコンドルパサー": 23, "オグリキャップ": 0, "キングヘイロー": 17, "グラスワンダー": 30, "ゴールドシップ": 20, "サイレンススズカ": 18, "サクラバクシンオー": 9, "シンボリルドルフ": 19, "スーパークリーク": 26, "スペシャルウィーク": 25, "タイキシャトル": 18, "ダイワスカーレット": 24, "テイエムオペラオー": 20, "トウカイテイオー": 18, "ナイスネイチャ": 26, "ハルウララ": 3, "ビワハヤヒデ": 18, "マチカネフクキタル": 25, "マヤノトップガン": 20, "マルゼンスキー": 18, "ミホノブルボン": 24, "メジロマックイーン": 18, "メジロライアン": 25, "ライスシャワー": 16, "": 0}, "キングヘイロー": {"アグネスタキオン": 19, "ウイニングチケット": 17, "ウオッカ": 18, "エアグルーヴ": 12, "エルコンドルパサー": 15, "オグリキャップ": 17, "キングヘイロー": 0, "グラスワンダー": 23, "ゴールドシップ": 11, "サイレンススズカ": 11, "サクラバクシンオー": 16, "シンボリルドルフ": 10, "スーパークリーク": 10, "スペシャルウィーク": 24, "タイキシャトル": 17, "ダイワスカーレット": 11, "テイエムオペラオー": 12, "トウカイテイオー": 13, "ナイスネイチャ": 20, "ハルウララ": 13, "ビワハヤヒデ": 10, "マチカネフクキタル": 18, "マヤノトップガン": 10, "マルゼンスキー": 16, "ミホノブルボン": 18, "メジロマックイーン": 14, "メジロライアン": 16, "ライスシャワー": 9, "": 0}, "グラスワンダー": {"アグネスタキオン": 23, "ウイニングチケット": 22, "ウオッカ": 29, "エアグルーヴ": 16, "エルコンドルパサー": 35, "オグリキャップ": 30, "キングヘイロー": 23, "グラスワンダー": 0, "ゴールドシップ": 17, "サイレンススズカ": 18, "サクラバクシンオー": 10, "シンボリルドルフ": 19, "スーパークリーク": 15, "スペシャルウィーク": 31, "タイキシャトル": 19, "ダイワスカーレット": 23, "テイエムオペラオー": 19, "トウカイテイオー": 17, "ナイスネイチャ": 24, "ハルウララ": 3, "ビワハヤヒデ": 16, "マチカネフクキタル": 23, "マヤノトップガン": 18, "マルゼンスキー": 17, "ミホノブルボン": 23, "メジロマックイーン": 16, "メジロライアン": 25, "ライスシャワー": 18, "": 0}, "ゴールドシップ": {"アグネスタキオン": 18, "ウイニングチケット": 22, "ウオッカ": 16, "エアグルーヴ": 19, "エルコンドルパサー": 17, "オグリキャップ": 20, "キングヘイロー": 11, "グラスワンダー": 17, "ゴールドシップ": 0, "サイレンススズカ": 19, "サクラバクシンオー": 9, "シンボリルドルフ": 28, "スーパークリーク": 28, "スペシャルウィーク": 26, "タイキシャトル": 9, "ダイワスカーレット": 18, "テイエムオペラオー": 29, "トウカイテイオー": 20, "ナイスネイチャ": 26, "ハルウララ": 11, "ビワハヤヒデ": 31, "マチカネフクキタル": 19, "マヤノトップガン": 30, "マルゼンスキー": 9, "ミホノブルボン": 18, "メジロマックイーン": 31, "メジロライアン": 19, "ライスシャワー": 25, "": 0}, "サイレンススズカ": {"アグネスタキオン": 20, "ウイニングチケット": 18, "ウオッカ": 16, "エアグルーヴ": 18, "エルコンドルパサー": 17, "オグリキャップ": 18, "キングヘイロー": 11, "グラスワンダー": 18, "ゴールドシップ": 19, "サイレンススズカ": 0, "サクラバクシンオー": 13, "シンボリルドルフ": 16, "スーパークリーク": 20, "スペシャルウィーク": 23, "タイキシャトル": 14, "ダイワスカーレット": 17, "テイエムオペラオー": 19, "トウカイテイオー": 18, "ナイスネイチャ": 19, "ハルウララ": 3, "ビワハヤヒデ": 18, "マチカネフクキタル": 27, "マヤノトップガン": 26, "マルゼンスキー": 17, "ミホノブルボン": 26, "メジロマックイーン": 20, "メジロライアン": 18, "ライスシャワー": 17, "": 0}, "サクラバクシンオー": {"アグネスタキオン": 11, "ウイニングチケット": 10, "ウオッカ": 8, "エアグルーヴ": 17, "エルコンドルパサー": 17, "オグリキャップ": 9, "キングヘイロー": 16, "グラスワンダー": 10, "ゴールドシップ": 9, "サイレンススズカ": 13, "サクラバクシンオー": 0, "シンボリルドルフ": 17, "スーパークリーク": 17, "スペシャルウィーク": 9, "タイキシャトル": 29, "ダイワスカーレット": 15, "テイエムオペラオー": 16, "トウカイテイオー": 17, "ナイスネイチャ": 12, "ハルウララ": 10, "ビワハヤヒデ": 16, "マチカネフクキタル": 13, "マヤノトップガン": 9, "マルゼンスキー": 16, "ミホノブルボン": 19, "メジロマックイーン": 18, "メジロライアン": 14, "ライスシャワー": 21, "": 0}, "シンボリルドルフ": {"アグネスタキオン": 18, "ウイニングチケット": 18, "ウオッカ": 17, "エアグルーヴ": 25, "エルコンドルパサー": 27, "オグリキャップ": 19, "キングヘイロー": 10, "グラスワンダー": 19, "ゴールドシップ": 28, "サイレンススズカ": 16, "サクラバクシンオー": 17, "シンボリルドルフ": 0, "スーパークリーク": 33, "スペシャルウィーク": 26, "タイキシャトル": 20, "ダイワスカーレット": 24, "テイエムオペラオー": 35, "トウカイテイオー": 28, "ナイスネイチャ": 22, "ハルウララ": 1, "ビワハヤヒデ": 33, "マチカネフクキタル": 16, "マヤノトップガン": 26, "マルゼンスキー": 11, "ミホノブルボン": 17, "メジロマックイーン": 31, "メジロライアン": 17, "ライスシャワー": 36, "": 0}, "スーパークリーク": {"アグネスタキオン": 18, "ウイニングチケット": 19, "ウオッカ": 17, "エアグルーヴ": 25, "エルコンドルパサー": 23, "オグリキャップ": 26, "キングヘイロー": 10, "グラスワンダー": 15, "ゴールドシップ": 28, "サイレンススズカ": 20, "サクラバクシンオー": 17, "シンボリルドルフ": 33, "スーパークリーク": 0, "スペシャルウィーク": 29, "タイキシャトル": 16, "ダイワスカーレット": 25, "テイエムオペラオー": 33, "トウカイテイオー": 24, "ナイスネイチャ": 25, "ハルウララ": 3, "ビワハヤヒデ": 34, "マチカネフクキタル": 21, "マヤノトップガン": 27, "マルゼンスキー": 11, "ミホノブルボン": 17, "メジロマックイーン": 34, "メジロライアン": 16, "ライスシャワー": 32, "": 0}, "スペシャルウィーク": {"アグネスタキオン": 25, "ウイニングチケット": 27, "ウオッカ": 26, "エアグルーヴ": 18, "エルコンドルパサー": 25, "オグリキャップ": 25, "キングヘイロー": 24, "グラスワンダー": 31, "ゴールドシップ": 26, "サイレンススズカ": 23, "サクラバクシンオー": 9, "シンボリルドルフ": 26, "スーパークリーク": 29, "スペシャルウィーク": 0, "タイキシャトル": 9, "ダイワスカーレット": 17, "テイエムオペラオー": 31, "トウカイテイオー": 20, "ナイスネイチャ": 35, "ハルウララ": 7, "ビワハヤヒデ": 25, "マチカネフクキタル": 28, "マヤノトップガン": 26, "マルゼンスキー": 11, "ミホノブルボン": 18, "メジロマックイーン": 27, "メジロライアン": 24, "ライスシャワー": 23, "": 0}, "タイキシャトル": {"アグネスタキオン": 11, "ウイニングチケット": 9, "ウオッカ": 16, "エアグルーヴ": 16, "エルコンドルパサー": 27, "オグリキャップ": 18, "キングヘイロー": 17, "グラスワンダー": 19, "ゴールドシップ": 9, "サイレンススズカ": 14, "サクラバクシンオー": 29, "シンボリルドルフ": 20, "スーパークリーク": 16, "スペシャルウィーク": 9, "タイキシャトル": 0, "ダイワスカーレット": 22, "テイエムオペラオー": 17, "トウカイテイオー": 17, "ナイスネイチャ": 9, "ハルウララ": 7, "ビワハヤヒデ": 16, "マチカネフクキタル": 15, "マヤノトップガン": 9, "マルゼンスキー": 24, "ミホノブルボン": 24, "メジロマックイーン": 16, "メジロライアン": 11, "ライスシャワー": 21, "": 0}, "ダイワスカーレット": {"アグネスタキオン": 17, "ウイニングチケット": 17, "ウオッカ": 34, "エアグルーヴ": 27, "エルコンドルパサー": 30, "オグリキャップ": 24, "キングヘイロー": 11, "グラスワンダー": 23, "ゴールドシップ": 18, "サイレンススズカ": 17, "サクラバクシンオー": 15, "シンボリルドルフ": 24, "スーパークリーク": 25, "スペシャルウィーク": 17, "タイキシャトル": 22, "ダイワスカーレット": 0, "テイエムオペラオー": 24, "トウカイテイオー": 30, "ナイスネイチャ": 16, "ハルウララ": 4, "ビワハヤヒデ": 24, "マチカネフクキタル": 17, "マヤノトップガン": 17, "マルゼンスキー": 17, "ミホノブルボン": 23, "メジロマックイーン": 28, "メジロライアン": 14, "ライスシャワー": 22, "": 0}, "テイエムオペラオー": {"アグネスタキオン": 19, "ウイニングチケット": 18, "ウオッカ": 18, "エアグルーヴ": 24, "エルコンドルパサー": 26, "オグリキャップ": 20, "キングヘイロー": 12, "グラスワンダー": 19, "ゴールドシップ": 29, "サイレンススズカ": 19, "サクラバクシンオー": 16, "シンボリルドルフ": 35, "スーパークリーク": 33, "スペシャルウィーク": 31, "タイキシャトル": 17, "ダイワスカーレット": 24, "テイエムオペラオー": 0, "トウカイテイオー": 27, "ナイスネイチャ": 26, "ハルウララ": 5, "ビワハヤヒデ": 36, "マチカネフクキタル": 17, "マヤノトップガン": 29, "マルゼンスキー": 8, "ミホノブルボン": 18, "メジロマックイーン": 33, "メジロライアン": 16, "ライスシャワー": 32, "": 0}, "トウカイテイオー": {"アグネスタキオン": 21, "ウイニングチケット": 19, "ウオッカ": 24, "エアグルーヴ": 26, "エルコンドルパサー": 24, "オグリキャップ": 18, "キングヘイロー": 13, "グラスワンダー": 17, "ゴールドシップ": 20, "サイレンススズカ": 18, "サクラバクシンオー": 17, "シンボリルドルフ": 28, "スーパークリーク": 24, "スペシャルウィーク": 20, "タイキシャトル": 17, "ダイワスカーレット": 30, "テイエムオペラオー": 27, "トウカイテイオー": 0, "ナイスネイチャ": 21, "ハルウララ": 3, "ビワハヤヒデ": 25, "マチカネフクキタル": 17, "マヤノトップガン": 20, "マルゼンスキー": 9, "ミホノブルボン": 20, "メジロマックイーン": 31, "メジロライアン": 17, "ライスシャワー": 25, "": 0}, "ナイスネイチャ": {"アグネスタキオン": 26, "ウイニングチケット": 25, "ウオッカ": 24, "エアグルーヴ": 17, "エルコンドルパサー": 17, "オグリキャップ": 26, "キングヘイロー": 20, "グラスワンダー": 24, "ゴールドシップ": 26, "サイレンススズカ": 19, "サクラバクシンオー": 12, "シンボリルドルフ": 22, "スーパークリーク": 25, "スペシャルウィーク": 35, "タイキシャトル": 9, "ダイワスカーレット": 16, "テイエムオペラオー": 26, "トウカイテイオー": 21, "ナイスネイチャ": 0, "ハルウララ": 5, "ビワハヤヒデ": 24, "マチカネフクキタル": 25, "マヤノトップガン": 25, "マルゼンスキー": 8, "ミホノブルボン": 18, "メジロマックイーン": 27, "メジロライアン": 25, "ライスシャワー": 24, "": 0}, "ハルウララ": {"アグネスタキオン": 3, "ウイニングチケット": 3, "ウオッカ": 3, "エアグルーヴ": 3, "エルコンドルパサー": 2, "オグリキャップ": 3, "キングヘイロー": 13, "グラスワンダー": 3, "ゴールドシップ": 11, "サイレンススズカ": 3, "サクラバクシンオー": 10, "シンボリルドルフ": 1, "スーパークリーク": 3, "スペシャルウィーク": 7, "タイキシャトル": 7, "ダイワスカーレット": 4, "テイエムオペラオー": 5, "トウカイテイオー": 3, "ナイスネイチャ": 5, "ハルウララ": 0, "ビワハヤヒデ": 2, "マチカネフクキタル": 3, "マヤノトップガン": 3, "マルゼンスキー": 7, "ミホノブルボン": 9, "メジロマックイーン": 4, "メジロライアン": 1, "ライスシャワー": 2, "": 0}, "ビワハヤヒデ": {"アグネスタキオン": 17, "ウイニングチケット": 26, "ウオッカ": 16, "エアグルーヴ": 25, "エルコンドルパサー": 23, "オグリキャップ": 18, "キングヘイロー": 10, "グラスワンダー": 16, "ゴールドシップ": 31, "サイレンススズカ": 18, "サクラバクシンオー": 16, "シンボリルドルフ": 33, "スーパークリーク": 34, "スペシャルウィーク": 25, "タイキシャトル": 16, "ダイワスカーレット": 24, "テイエムオペラオー": 36, "トウカイテイオー": 25, "ナイスネイチャ": 24, "ハルウララ": 2, "ビワハヤヒデ": 0, "マチカネフクキタル": 18, "マヤノトップガン": 28, "マルゼンスキー": 9, "ミホノブルボン": 17, "メジロマックイーン": 35, "メジロライアン": 18, "ライスシャワー": 32, "": 0}, "マチカネフクキタル": {"アグネスタキオン": 27, "ウイニングチケット": 25, "ウオッカ": 23, "エアグルーヴ": 17, "エルコンドルパサー": 16, "オグリキャップ": 25, "キングヘイロー": 18, "グラスワンダー": 23, "ゴールドシップ": 19, "サイレンススズカ": 27, "サクラバクシンオー": 13, "シンボリルドルフ": 16, "スーパークリーク": 21, "スペシャルウィーク": 28, "タイキシャトル": 15, "ダイワスカーレット": 17, "テイエムオペラオー": 17, "トウカイテイオー": 17, "ナイスネイチャ": 25, "ハルウララ": 3, "ビワハヤヒデ": 18, "マチカネフクキタル": 0, "マヤノトップガン": 19, "マルゼンスキー": 10, "ミホノブルボン": 19, "メジロマックイーン": 19, "メジロライアン": 23, "ライスシャワー": 19, "": 0}, "マヤノトップガン": {"アグネスタキオン": 17, "ウイニングチケット": 20, "ウオッカ": 16, "エアグルーヴ": 16, "エルコンドルパサー": 16, "オグリキャップ": 20, "キングヘイロー": 10, "グラスワンダー": 18, "ゴールドシップ": 30, "サイレンススズカ": 26, "サクラバクシンオー": 9, "シンボリルドルフ": 26, "スーパークリーク": 27, "スペシャルウィーク": 26, "タイキシャトル": 9, "ダイワスカーレット": 17, "テイエムオペラオー": 29, "トウカイテイオー": 20, "ナイスネイチャ": 25, "ハルウララ": 3, "ビワハヤヒデ": 28, "マチカネフクキタル": 19, "マヤノトップガン": 0, "マルゼンスキー": 15, "ミホノブルボン": 24, "メジロマックイーン": 28, "メジロライアン": 17, "ライスシャワー": 25, "": 0}, "マルゼンスキー": {"アグネスタキオン": 10, "ウイニングチケット": 10, "ウオッカ": 15, "エアグルーヴ": 9, "エルコンドルパサー": 17, "オグリキャップ": 18, "キングヘイロー": 16, "グラスワンダー": 17, "ゴールドシップ": 9, "サイレンススズカ": 17, "サクラバクシンオー": 16, "シンボリルドルフ": 11, "スーパークリーク": 11, "スペシャルウィーク": 11, "タイキシャトル": 24, "ダイワスカーレット": 17, "テイエムオペラオー": 8, "トウカイテイオー": 9, "ナイスネイチャ": 8, "ハルウララ": 7, "ビワハヤヒデ": 9, "マチカネフクキタル": 10, "マヤノトップガン": 15, "マルゼンスキー": 0, "ミホノブルボン": 30, "メジロマックイーン": 8, "メジロライアン": 8, "ライスシャワー": 10, "": 0}, "ミホノブルボン": {"アグネスタキオン": 21, "ウイニングチケット": 18, "ウオッカ": 25, "エアグルーヴ": 17, "エルコンドルパサー": 22, "オグリキャップ": 24, "キングヘイロー": 18, "グラスワンダー": 23, "ゴールドシップ": 18, "サイレンススズカ": 26, "サクラバクシンオー": 19, "シンボリルドルフ": 17, "スーパークリーク": 17, "スペシャルウィーク": 18, "タイキシャトル": 24, "ダイワスカーレット": 23, "テイエムオペラオー": 18, "トウカイテイオー": 20, "ナイスネイチャ": 18, "ハルウララ": 9, "ビワハヤヒデ": 17, "マチカネフクキタル": 19, "マヤノトップガン": 24, "マルゼンスキー": 30, "ミホノブルボン": 0, "メジロマックイーン": 18, "メジロライアン": 16, "ライスシャワー": 18, "": 0}, "メジロマックイーン": {"アグネスタキオン": 19, "ウイニングチケット": 19, "ウオッカ": 21, "エアグルーヴ": 25, "エルコンドルパサー": 22, "オグリキャップ": 18, "キングヘイロー": 14, "グラスワンダー": 16, "ゴールドシップ": 31, "サイレンススズカ": 20, "サクラバクシンオー": 18, "シンボリルドルフ": 31, "スーパークリーク": 34, "スペシャルウィーク": 27, "タイキシャトル": 16, "ダイワスカーレット": 28, "テイエムオペラオー": 33, "トウカイテイオー": 31, "ナイスネイチャ": 27, "ハルウララ": 4, "ビワハヤヒデ": 35, "マチカネフクキタル": 19, "マヤノトップガン": 28, "マルゼンスキー": 8, "ミホノブルボン": 18, "メジロマックイーン": 0, "メジロライアン": 22, "ライスシャワー": 33, "": 0}, "メジロライアン": {"アグネスタキオン": 24, "ウイニングチケット": 25, "ウオッカ": 22, "エアグルーヴ": 17, "エルコンドルパサー": 17, "オグリキャップ": 25, "キングヘイロー": 16, "グラスワンダー": 25, "ゴールドシップ": 19, "サイレンススズカ": 18, "サクラバクシンオー": 14, "シンボリルドルフ": 17, "スーパークリーク": 16, "スペシャルウィーク": 24, "タイキシャトル": 11, "ダイワスカーレット": 14, "テイエムオペラオー": 16, "トウカイテイオー": 17, "ナイスネイチャ": 25, "ハルウララ": 1, "ビワハヤヒデ": 18, "マチカネフクキタル": 23, "マヤノトップガン": 17, "マルゼンスキー": 8, "ミホノブルボン": 16, "メジロマックイーン": 22, "メジロライアン": 0, "ライスシャワー": 19, "": 0}, "ライスシャワー": {"アグネスタキオン": 18, "ウイニングチケット": 16, "ウオッカ": 15, "エアグルーヴ": 22, "エルコンドルパサー": 26, "オグリキャップ": 16, "キングヘイロー": 9, "グラスワンダー": 18, "ゴールドシップ": 25, "サイレンススズカ": 17, "サクラバクシンオー": 21, "シンボリルドルフ": 36, "スーパークリーク": 32, "スペシャルウィーク": 23, "タイキシャトル": 21, "ダイワスカーレット": 22, "テイエムオペラオー": 32, "トウカイテイオー": 25, "ナイスネイチャ": 24, "ハルウララ": 2, "ビワハヤヒデ": 32, "マチカネフクキタル": 19, "マヤノトップガン": 25, "マルゼンスキー": 10, "ミホノブルボン": 18, "メジロマックイーン": 33, "メジロライアン": 19, "ライスシャワー": 0, "": 0}, "": {"アグネスタキオン": 0, "ウイニングチケット": 0, "ウオッカ": 0, "エアグルーヴ": 0, "エルコンドルパサー": 0, "オグリキャップ": 0, "キングヘイロー": 0, "グラスワンダー": 0, "ゴールドシップ": 0, "サイレンススズカ": 0, "サクラバクシンオー": 0, "シンボリルドルフ": 0, "スーパークリーク": 0, "スペシャルウィーク": 0, "タイキシャトル": 0, "ダイワスカーレット": 0, "テイエムオペラオー": 0, "トウカイテイオー": 0, "ナイスネイチャ": 0, "ハルウララ": 0, "ビワハヤヒデ": 0, "マチカネフクキタル": 0, "マヤノトップガン": 0, "マルゼンスキー": 0, "ミホノブルボン": 0, "メジロマックイーン": 0, "メジロライアン": 0, "ライスシャワー": 0, "": 0}};

const umaNames = [
  "スペシャルウィーク",
  "サイレンススズカ",
  "トウカイテイオー",
  "マルゼンスキー",
  "オグリキャップ",
  "ダイワスカーレット",
  "タイキシャトル",
  "メジロマックイーン",
  "エルコンドルパサー",
  "シンボリルドルフ",
  "エアグルーヴ",
  "ライスシャワー",
  "ゴールドシップ",
  "ウオッカ",
  "グラスワンダー",
  "マヤノトップガン",
  "メジロライアン",
  "アグネスタキオン",
  "ウイニングチケット",
  "サクラバクシンオー",
  "スーパークリーク",
  "ハルウララ",
  "マチカネフクキタル",
  "ナイスネイチャ",
  "キングヘイロー",
  "テイエムオペラオー",
  "ミホノブルボン",
  "ビワハヤヒデ"
];

const umaReration = {"101": "2", "102": "2", "103": "2", "104": "2", "105": "2", "106": "2", "107": "2", "201": "2", "202": "2", "203": "2", "204": "2", "301": "2", "302": "2", "303": "2", "304": "2", "305": "2", "306": "2", "307": "2", "308": "2", "309": "2", "310": "2", "311": "2", "312": "2", "313": "2", "314": "2", "315": "2", "316": "2", "317": "2", "318": "2", "319": "2", "320": "2", "321": "2", "322": "2", "323": "2", "401": "2", "402": "2", "403": "2", "404": "2", "501": "2", "502": "2", "503": "2", "504": "2", "505": "2", "506": "2", "507": "2", "508": "2", "509": "2", "510": "2", "2001": "1", "2002": "1", "2003": "1", "2101": "1", "2102": "1", "2103": "1", "2104": "1", "2105": "1", "2106": "1", "2107": "1", "2201": "1", "2301": "1", "2302": "1", "2303": "1", "2401": "1", "2402": "1", "2403": "1", "2404": "1", "2405": "1", "2406": "1", "2407": "1", "2408": "1", "2409": "1", "2501": "1", "2502": "1", "2503": "1", "2504": "1", "2505": "1", "2506": "1", "2507": "1", "2508": "1", "2509": "1", "2510": "1", "2511": "1", "2512": "1", "2513": "1", "2514": "1", "2515": "1", "2516": "1", "2517": "1", "2518": "1", "2519": "1", "2520": "1", "2521": "1", "2522": "1", "2523": "1", "2524": "1", "2525": "1", "2526": "1", "2527": "1", "2528": "1", "2529": "1", "2530": "1", "2531": "1", "2601": "1", "2602": "1", "2603": "1", "2604": "1", "2701": "1", "2702": "1", "2703": "1", "2704": "1", "2705": "1", "2706": "1", "2801": "1", "2802": "1", "2803": "1", "2804": "1", "2805": "1", "2806": "1", "2807": "1", "2808": "1", "2809": "1", "2810": "1", "2811": "1", "2812": "1", "2813": "1", "2814": "1", "2815": "1", "2816": "1", "2817": "1", "2901": "7", "2902": "7", "2903": "7", "2904": "7", "3001": "7", "3002": "7", "3003": "7", "3004": "7", "3101": "7", "3102": "7", "3201": "1", "3202": "1", "3203": "1", "3204": "1", "3205": "1", "3206": "1", "5001": "1", "5002": "1", "7000": "1", "7001": "1", "7002": "1", "7003": "1", "7004": "1", "7005": "1", "7006": "1", "7007": "1", "7008": "1", "7009": "1", "7010": "1", "7011": "1", "7012": "1", "7013": "1", "7014": "1", "7015": "1", "7016": "1", "7017": "1", "7018": "1", "7019": "1", "7020": "1", "7021": "1", "7022": "1", "7023": "1", "7024": "1", "8001": "1", "8002": "1", "8003": "1", "8004": "1", "8005": "1", "8006": "1", "8007": "1", "8008": "1", "8009": "1", "8010": "1", "8011": "1", "8012": "1", "8013": "1", "8014": "1", "8015": "1", "8016": "1", "8017": "1", "8018": "1", "8019": "1", "8020": "1", "8021": "1", "8022": "1", "8023": "1", "8024": "1", "8025": "1", "8026": "1", "8027": "1", "8028": "1", "8029": "1", "8030": "1", "8031": "1", "8032": "1", "8033": "1", "8034": "1", "8035": "1", "8036": "1", "8037": "1", "8038": "1", "8039": "1", "8040": "1", "8041": "1", "8042": "1", "8043": "1", "8044": "1", "8045": "1", "8046": "1", "8047": "1", "8048": "1", "8049": "1", "8050": "1", "8051": "1", "8052": "1", "8053": "1", "8054": "1", "8055": "1", "8056": "1", "8057": "1", "8058": "1", "8059": "1", "8060": "1", "8061": "1", "8062": "1", "8063": "1", "8064": "1", "8065": "1", "8066": "1", "8067": "1", "8068": "1", "8069": "1", "8070": "1", "8071": "1", "8072": "1", "8073": "1", "8074": "1", "8075": "1", "8076": "1", "8077": "1", "8078": "1", "8079": "1", "8080": "1", "8081": "1", "8082": "1", "8083": "1", "8084": "1", "8085": "1", "8086": "1", "8087": "1", "8088": "1", "8089": "1", "8090": "1", "8091": "1", "8092": "1", "8093": "1", "8094": "1", "8095": "1", "8096": "1", "8097": "1", "8098": "1", "8099": "1", "8100": "1", "8101": "1", "8102": "1", "8103": "1", "8104": "1", "8105": "1", "8106": "1", "8107": "1", "8108": "1", "8109": "1", "8110": "1", "8111": "1", "8112": "1", "8113": "1", "8114": "1", "8115": "1", "8116": "1", "8117": "1", "8118": "1", "8119": "1", "8120": "1", "8121": "1", "8122": "1", "8123": "1", "8124": "1", "8125": "1", "8126": "1", "8127": "1", "8128": "1", "8129": "1", "8130": "1", "8131": "1", "8132": "1", "8133": "1", "8134": "1", "8135": "1", "8136": "1", "8137": "1", "8138": "1", "8139": "1", "8140": "1", "8141": "1", "8142": "1", "8143": "1", "8144": "1", "8145": "1", "8146": "1", "8147": "1", "8148": "1", "8149": "1", "8150": "1", "8151": "1", "8152": "1", "8153": "1", "8154": "1", "8155": "1", "8156": "1", "8157": "1", "8158": "1", "8159": "1", "8160": "1", "8161": "1", "8162": "1", "8163": "1", "8164": "1", "8165": "1", "8166": "1", "8167": "1", "8168": "1", "8169": "1", "8170": "1", "8171": "1", "8172": "1", "8173": "1", "8174": "1", "8175": "1", "8176": "1", "8177": "1", "8178": "1", "8179": "1", "8180": "1", "8181": "1", "8182": "1", "8183": "1", "8184": "1", "8185": "1", "8186": "1", "8187": "1", "8188": "1", "8189": "1", "8190": "1", "8191": "1", "8192": "1", "8193": "1", "8194": "1", "8195": "1", "8196": "1", "8197": "1", "8198": "1", "8199": "1", "8200": "1", "8201": "1", "8202": "1", "8203": "1", "8204": "1", "8205": "1", "8206": "1", "8207": "1", "8208": "1", "8209": "1", "8210": "1", "8211": "1", "8212": "1", "8213": "1", "8214": "1", "8215": "1", "8216": "1", "8217": "1", "8218": "1", "8219": "1", "8220": "1", "8221": "1", "8222": "1", "8223": "1", "8224": "1", "8225": "1", "8226": "1", "8227": "1", "8228": "1", "8229": "1", "8230": "1", "8231": "1", "8232": "1", "8233": "1", "8234": "1", "8235": "1", "8236": "1", "8237": "1", "8238": "1", "8239": "1", "8240": "1", "8241": "1", "8242": "1", "8243": "1", "8244": "1", "8245": "1", "8246": "1", "8247": "1", "8248": "1", "8249": "1", "8250": "1", "8251": "1", "8252": "1", "8253": "1", "8254": "1", "8255": "1", "8256": "1", "8257": "1", "8258": "1", "8259": "1", "8260": "1", "8261": "1", "8262": "1", "8263": "1", "8264": "1", "8265": "1", "8266": "1", "8267": "1", "8268": "1", "8269": "1", "8270": "1", "8271": "1", "8272": "1", "8273": "1", "8274": "1", "8275": "1", "8276": "1", "8277": "1", "8278": "1", "8279": "1", "8280": "1", "8281": "1", "8282": "1", "8283": "1", "8284": "1", "8285": "1", "8286": "1", "8287": "1", "8288": "1", "8289": "1", "8290": "1", "8291": "1", "8292": "1", "8293": "1", "8294": "1", "8295": "1", "8296": "1", "8297": "1", "8298": "1", "8299": "1", "8300": "1", "8301": "1", "8302": "1", "8303": "1", "8304": "1", "8305": "1", "8306": "1", "8307": "1", "8308": "1", "8309": "1", "8310": "1", "8311": "1", "8312": "1", "8313": "1", "8314": "1", "8315": "1", "8316": "1", "8317": "1", "8318": "1", "8319": "1", "8320": "1", "8321": "1", "8322": "1", "8323": "1", "8324": "1", "8325": "1", "8326": "1", "8327": "1", "8328": "1", "8329": "1", "8330": "1", "8331": "1", "8332": "1", "8333": "1", "8334": "1", "8335": "1", "8336": "1", "8337": "1", "8338": "1", "8339": "1", "8340": "1", "8341": "1", "8342": "1", "8343": "1", "8344": "1", "8345": "1", "8346": "1", "8347": "1", "8348": "1", "8349": "1", "8350": "1", "8351": "1", "8352": "1", "8353": "1", "8354": "1", "8355": "1", "8356": "1", "8357": "1", "8358": "1", "8359": "1", "8360": "1", "8361": "1", "8362": "1", "8363": "1", "8364": "1", "8365": "1", "8366": "1", "8367": "1", "8368": "1", "8369": "1", "8370": "1", "8371": "1", "8372": "1", "8373": "1", "8374": "1", "8375": "1", "8376": "1", "8377": "1", "8378": "1", "8379": "1", "8380": "1", "8381": "1", "8382": "1", "8383": "1", "8384": "1", "8385": "1", "8386": "1", "8387": "1", "8388": "1", "8389": "1", "8390": "1", "8391": "1", "8392": "1", "8393": "1", "8394": "1", "8395": "1", "8396": "1", "8397": "1", "8398": "1", "8399": "1", "8400": "1", "8401": "1", "8402": "1", "8403": "1", "8404": "1", "8405": "1", "8406": "1", "8407": "1", "8408": "1", "8409": "1", "8410": "1", "8411": "1", "8412": "1", "8413": "1", "8414": "1", "8415": "1", "8416": "1", "8417": "1", "8418": "1", "8419": "1", "8420": "1", "8421": "1", "8422": "1", "8423": "1", "8424": "1", "8425": "1", "8426": "1"};
const umaRerationList = {"アグネスタキオン": ["104", "202", "314", "2001", "2107", "2601", "2814", "2903", "3003", "3101", "2505", "3204", "8219", "8220", "8221", "8222", "8223", "8224", "8225", "8226", "8227", "8228", "8229", "8230", "8231", "8232", "8233", "8234", "2407", "2604"], "ウイニングチケット": ["105", "202", "316", "404", "507", "2002", "2102", "2302", "2601", "7018", "7021", "2806", "2903", "3003", "3101", "2510", "3203", "8038", "8048", "8075", "8080", "8103", "8139", "8194", "8293", "8325", "8332", "8353", "8404", "2405", "2603"], "ウオッカ": ["102", "202", "303", "403", "2602", "7012", "2705", "2815", "2903", "3002", "3003", "3101", "2510", "2516", "2521", "2511", "2519", "2508", "3204", "2409", "2604"], "エアグルーヴ": ["105", "202", "307", "501", "2002", "2106", "2602", "7001", "2809", "2902", "3003", "3101", "2509", "2516", "3204", "8035", "8045", "8072", "8077", "8100", "8136", "8190", "8289", "8322", "8329", "8350", "8400", "2406", "2604"], "エルコンドルパサー": ["103", "201", "305", "401", "502", "2601", "7000", "7004", "2811", "2902", "3002", "3003", "3101", "2519", "2507", "3203", "8108", "8109", "8110", "8111", "8112", "8113", "8114", "8115", "2406", "2604"], "オグリキャップ": ["106", "202", "302", "506", "2601", "7009", "7010", "7011", "2701", "2802", "2903", "3002", "3003", "3101", "2523", "2511", "2518", "3203", "8068", "8069", "8070", "8071", "8116", "8178", "8275", "8285", "8310", "8413", "8415", "8417", "2403", "2603"], "キングヘイロー": ["103", "202", "322", "401", "504", "2601", "7007", "7023", "7024", "2811", "2903", "3001", "3101", "2502", "3204", "8371", "8419", "8420", "8421", "8422", "8423", "8424", "8425", "8426", "2406", "2604"], "グラスワンダー": ["103", "201", "305", "401", "502", "2103", "2601", "7003", "7013", "7023", "2811", "2903", "3002", "3003", "3101", "2523", "2512", "2522", "3202", "2406", "2604"], "ゴールドシップ": ["105", "202", "2101", "2303", "2601", "7016", "2706", "2904", "3003", "3004", "3101", "2523", "2512", "2506", "2505", "2515", "3203", "8033", "8043", "8072", "8073", "8074", "8075", "8076", "8098", "8109", "8134", "8145", "8181", "8268", "8278", "8303", "8313", "8320", "8373", "8420", "2603"], "サイレンススズカ": ["104", "202", "301", "402", "2001", "2601", "7000", "7001", "7002", "7013", "7015", "2810", "2901", "3003", "3101", "2512", "3205", "8017", "8018", "8019", "8020", "8021", "8022", "8023", "8024", "8025", "8026", "8027", "8028", "8029", "8030", "8031", "8032", "2406", "2603"], "サクラバクシンオー": ["104", "201", "402", "2003", "2106", "2601", "2805", "2902", "3001", "3101", "2513", "3204", "8287", "8288", "8289", "8290", "8291", "8292", "8293", "8294", "8295", "8296", "8297", "8298", "8299", "8300", "8301", "509", "2404", "2603"], "シンボリルドルフ": ["106", "201", "501", "2201", "2601", "2702", "2902", "3003", "3004", "3101", "2523", "2510", "2506", "2505", "2515", "2519", "3203", "8005", "8021", "8056", "8086", "8122", "8134", "8135", "8136", "8137", "8138", "8139", "8140", "8141", "8142", "8143", "8166", "8207", "8223", "8239", "8255", "8281", "8338", "8376", "8384", "8423", "2402", "2604"], "スーパークリーク": ["106", "202", "321", "506", "2601", "7011", "7017", "2802", "2902", "3003", "3004", "3101", "2506", "2516", "2515", "3205", "8011", "8027", "8062", "8070", "8092", "8112", "8128", "8148", "8158", "8172", "8184", "8198", "8213", "8229", "8245", "8261", "8271", "8297", "8306", "8316", "8320", "8321", "8322", "8323", "8324", "8325", "8326", "8327", "8328", "8344", "8356", "8390", "8397", "8408", "2403", "2603"], "スペシャルウィーク": ["103", "202", "301", "401", "502", "2001", "2102", "2301", "2601", "7003", "7004", "7005", "7006", "7007", "2811", "2903", "3003", "3004", "3101", "2510", "2506", "2516", "2519", "3205", "8001", "8002", "8003", "8004", "8005", "8006", "8007", "8008", "8009", "8010", "8011", "8012", "8013", "8014", "8015", "8016", "2406", "2603", "510"], "タイキシャトル": ["104", "201", "304", "402", "2601", "2810", "2902", "3001", "3002", "3101", "2511", "2518", "2513", "3203", "8082", "8083", "8084", "8085", "8086", "8087", "8088", "8089", "8090", "8091", "8092", "8093", "8094", "8095", "8096", "8097", "2406", "2604"], "ダイワスカーレット": ["102", "202", "303", "403", "2101", "2106", "2602", "7012", "2815", "2902", "3002", "3003", "3101", "2523", "2514", "2504", "2517", "3205", "8034", "8044", "8077", "8078", "8079", "8080", "8081", "8099", "8110", "8135", "8146", "8182", "8269", "8279", "8304", "8314", "8321", "8374", "8421", "2409", "2604"], "テイエムオペラオー": ["103", "202", "306", "2104", "2601", "7005", "2702", "2812", "2902", "3003", "3004", "3101", "2523", "2512", "2506", "2516", "2505", "2519", "3203", "8004", "8020", "8055", "8085", "8116", "8117", "8121", "8153", "8165", "8189", "8206", "8222", "8238", "8254", "8288", "8337", "8358", "8383", "8399"], "トウカイテイオー": ["102", "202", "308", "403", "2201", "2601", "7008", "7022", "2804", "2902", "3003", "3101", "2523", "2510", "2505", "2519", "3204", "8001", "8017", "8033", "8034", "8035", "8036", "8037", "8038", "8039", "8040", "8041", "8042", "8052", "8082", "8118", "8162", "8203", "8219", "8235", "8251", "8277", "8334", "8372", "8380", "8419", "2404", "2604"], "ナイスネイチャ": ["103", "202", "323", "2601", "7022", "2706", "2804", "2903", "3003", "3004", "3101", "3204", "8016", "8032", "8067", "8097", "8133", "8161", "8177", "8202", "8218", "8234", "8250", "8266", "8301", "8349", "8370", "8395", "8412", "8417", "8418", "2404", "2603"], "ハルウララ": ["103", "202", "322", "2602", "2812", "2904", "3001", "3102", "3202", "8366", "8372", "8373", "8374", "8375", "8376", "8377", "8378", "8379", "508", "509", "2407", "2603", "510"], "ビワハヤヒデ": ["105", "202", "306", "404", "507", "2601", "7018", "7019", "2703", "2806", "2902", "3003", "3004", "3101", "2512", "2506", "2515", "3203", "8037", "8047", "8074", "8079", "8102", "8138", "8192", "8291", "8324", "8331", "8352", "8402"], "マチカネフクキタル": ["104", "202", "402", "2601", "7002", "2810", "2903", "3003", "3101", "2515", "3205", "8013", "8029", "8064", "8094", "8130", "8174", "8215", "8231", "8247", "8263", "8346", "8392", "8396", "8397", "2406", "2603"], "マヤノトップガン": ["101", "202", "308", "2103", "2104", "2601", "2808", "2901", "3003", "3004", "3101", "2523", "2512", "2506", "2515", "3203", "2405", "2603"], "マルゼンスキー": ["106", "203", "2301", "2302", "2601", "2901", "3001", "3002", "3101", "2522", "3205", "8002", "8018", "8043", "8044", "8045", "8046", "8047", "8048", "8049", "8050", "8051", "8053", "8068", "8083", "8108", "8119", "8144", "8152", "8163", "8180", "8188", "8204", "8220", "8236", "8252", "8267", "8287", "8302", "8312", "8335", "8355", "8381", "8396", "8398", "2401", "2604"], "ミホノブルボン": ["104", "202", "310", "2601", "2805", "2901", "3001", "3002", "3003", "3101", "2510", "2522", "2505", "3204"], "メジロマックイーン": ["102", "202", "403", "503", "504", "2303", "2601", "7008", "7016", "2803", "2902", "3003", "3004", "3101", "2512", "2506", "2515", "3204", "8003", "8019", "8054", "8084", "8098", "8099", "8100", "8101", "8102", "8103", "8104", "8105", "8106", "8107", "8120", "8164", "8205", "8221", "8237", "8253", "8280", "8336", "8375", "8382", "8422", "2404", "2603"], "メジロライアン": ["105", "201", "311", "503", "2601", "7010", "7020", "2803", "2903", "3003", "3101", "2512", "3204", "8007", "8023", "8058", "8088", "8124", "8154", "8168", "8178", "8179", "8193", "8209", "8225", "8241", "8257", "8292", "8340", "8359", "8386", "8403", "2404", "2603"], "ライスシャワー": ["104", "201", "313", "2601", "2704", "2805", "2902", "3003", "3004", "3101", "2506", "2515", "3203", "8203", "8204", "8205", "8206", "8207", "8208", "8209", "8210", "8211", "8212", "8213", "8214", "8215", "8216", "8217", "8218", "508", "2404", "2604"]}


